// post 목록 화면을 제작 post.html, post.js
// fetch api를 사용하여 http://localhost:8080/posts 주소를 호출한 후

// 배열 목록을 div(카드) 목록으로 표시한다.

//    -----------------
//    | 게시자         |
//    | ------------- |
//    | 1제목(h3)       |
//    | 본문(p)        |
//    |  .....        |
//    |  .....        |
//    | ------------- |
//    | 생성시간       |
//    -----------------
//
//    -----------------
//    | 게시자         |
//    | ------------- |
//    | 2제목(h3)       |
//    | 본문(p)        |
//    |  .....        |
//    |  .....        |
//    | ------------- |
//    | 생성시간       |
//    -----------------
